# GROUPBY

In [1]:
import pandas as pd

In [4]:
var=pd.DataFrame({"first":['a','a','a','a','b','b','c','c','d'], "c1":[1,2,3,4,5,6,7,8,9] ,"c2":[10,11,12,13,14,15,16,17,18]})
var

  first  c1  c2
0     a   1  10
1     a   2  11
2     a   3  12
3     a   4  13
4     b   5  14
5     b   6  15
6     c   7  16
7     c   8  17
8     d   9  18

In [7]:
var_new=var.groupby("first")

In [8]:
var_new

In [6]:
for x , y in var_new:
    print(x)
    print(y)
    print()

a
  first  c1  c2
0     a   1  10
1     a   2  11
2     a   3  12
3     a   4  13

b
  first  c1  c2
4     b   5  14
5     b   6  15

c
  first  c1  c2
6     c   7  16
7     c   8  17

d
  first  c1  c2
8     d   9  18

In [9]:
var_new.get_group("a")

  first  c1  c2
0     a   1  10
1     a   2  11
2     a   3  12
3     a   4  13

In [10]:
var_new.min()

       c1  c2
first
a       1  10
b       5  14
c       7  16
d       9  18

In [11]:
var_new.max()

       c1  c2
first
a       4  13
b       6  15
c       8  17
d       9  18

In [12]:
var_new.mean()

        c1    c2
first
a      2.5  11.5
b      5.5  14.5
c      7.5  16.5
d      9.0  18.0

In [13]:
l=list(var_new)

In [14]:
l

[('a',
    first  c1  c2
  0     a   1  10
  1     a   2  11
  2     a   3  12
  3     a   4  13),
 ('b',
    first  c1  c2
  4     b   5  14
  5     b   6  15),
 ('c',
    first  c1  c2
  6     c   7  16
  7     c   8  17),
 ('d',
    first  c1  c2
  8     d   9  18)]